Revit 2024 API
FabricationPart.GetPartAncillaryUsage Method
 Gets a list of all ancillary usage information for the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public IList<FabricationAncillaryUsage> GetPartAncillaryUsage()
Visual Basic
Public Function GetPartAncillaryUsage As IList(Of FabricationAncillaryUsage)
Visual C++
public:
IList<FabricationAncillaryUsage^>^ GetPartAncillaryUsage()
Return Value
 Returns array of usage information, one per unique type of ancillary used.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace